-----------------------------------------------------------------------------------------------
--	Nanimosinai11000思考ロジック
--	説明：
-----------------------------------------------------------------------------------------------
REGISTER_LOGIC_FUNC(LOGIC_ID_Nanimosinai11000, "Nanimosinai11000_Logic", "Nanimosinai11000_Interupt");

-----------------------------------------------------------------------------------------------
--	Nanimosinai11000思考ロジック
--	この中で現在の状況を判別し、使用するトップゴールをひとつ決定します。
-----------------------------------------------------------------------------------------------
function	Nanimosinai11000_Logic(ai)

	if ai:IsSearchTarget(TARGET_ENE_0) == true then
		--敵を見つけたら
		ai:AddTopGoal( GOAL_Nanimosinai11000_Battle, -1, 0,0,0,0 );
		--戦闘状態になる
		return;
	end;
	
	ai:AddTopGoal( GOAL_COMMON_Stay, -1, 0,0,0,0 );
	--待機状態になる
end


-----------------------------------------------------------------------------------------------
--	Nanimosinai11000割り込みロジック
--	現在の状態でわりこめるのであればtrueを、
--	そのまま無視するのであればfalseを返してください。
-----------------------------------------------------------------------------------------------
function	Nanimosinai11000_Interupt(ai, goal)
end



