-----------------------------------------------------------------------------------------------
--	ウロコ鉱夫（ピックル・非戦）用の思考ロジック
--	説明：
-----------------------------------------------------------------------------------------------
REGISTER_LOGIC_FUNC(LOGIC_ID_uroko211004, "uroko211004_Logic", "uroko211004_Interupt");

-----------------------------------------------------------------------------------------------
--	ウロコ鉱夫（ピックル・非戦）用の思考ロジック
--	この中で現在の状況を判別し、使用するトップゴールをひとつ決定します。
-----------------------------------------------------------------------------------------------
function	uroko211004_Logic(ai)

	-- 命令が来ていなければ待機
	if ai:GetTeamRecordCount(COORDINATE_TYPE_AttackOrder, TARGET_ENE_0, 100.0) <= 0 then
		-- 命令がないので採掘
		ai:ChangeMoveAnimParam(0)
		-- 堀位置まで移動して待機（＝堀作業中）
		-- 非戦闘行動　敵みつけたらすぐに終了
		ai:AddTopGoal( GOAL_COMMON_NonBattleAct, 10.0, -1.0, false, 0, 0);
	else
		-- 共通関数でロジックを判別
		COMMON_EasySetup3(ai);
	end
end



-----------------------------------------------------------------------------------------------
--	ウロコ鉱夫（ピックル・非戦）用の割り込みロジック
--	現在の状態でわりこめるのであればtrueを、
--	そのまま無視するのであればfalseを返してください。
-----------------------------------------------------------------------------------------------
function	uroko211004_Interupt(ai, goal)
	if ai:IsInterupt( INTERUPT_Damaged_Stranger ) then
		-- 知らない人に殴られた
		goal:ClearSubGoal();
		-- 現在のゴールを消去
		goal:AddSubGoal( GOAL_uroko211004_Battle, -1, 0,0,0,0 );
		-- 仕切りなおし
		
	end;
end


