-----------------------------------------------------------------------------------------------
--	ヒロインの思考ロジック
--	説明：
-----------------------------------------------------------------------------------------------
REGISTER_LOGIC_FUNC(LOGIC_ID_Heroine_715000, "heroine_715000_Logic", "heroine_715000_Interupt");

-----------------------------------------------------------------------------------------------
--	ヒロインの思考ロジック
--	この中で現在の状況を判別し、使用するトップゴールをひとつ決定します。
-----------------------------------------------------------------------------------------------
function	heroine_715000_Logic(ai)

local eventNo = ai:GetEventRequest(0);		--イベントリクエスト取得　スロット0

	if eventNo == 10 then
		ai:AddTopGoal( GOAL_Heroine_715000_Battle, -1, 0,0,0,0 );
		
	-- 共通関数でロジックを判別
	-- この中で戦闘、非戦闘を判別して設定を行っている。
	else
		HEROINE_EasySetup3( ai);
	end

end


-----------------------------------------------------------------------------------------------
--	ヒロインの割り込みロジック
--	現在の状態でわりこめるのであればtrueを、
--	そのまま無視するのであればfalseを返してください。
-----------------------------------------------------------------------------------------------
function	heroine_715000_Interupt(ai, goal)
end





