-----------------------------------------------------------------------------------------------
--	レンドル王子用の思考ロジック
--	説明：
-----------------------------------------------------------------------------------------------
REGISTER_LOGIC_FUNC(LOGIC_ID_Ouji_807000, "ouji_807000_Logic", "ouji_807000_Interupt");

-----------------------------------------------------------------------------------------------
--	レンドル王子用の思考ロジック
--	この中で現在の状況を判別し、使用するトップゴールをひとつ決定します。
-----------------------------------------------------------------------------------------------
function	ouji_807000_Logic(ai)

local eventNo = ai:GetEventRequest();			--イベントからのリクエスト番号を取得

	if eventNo == 10 then
		ai:AddTopGoal( GOAL_COMMON_ApproachTarget, 3.0, POINT_INITIAL, 2.0, TARGET_NONE, false, -1 );
--		ai:AddTopGoal( GOAL_COMMON_NonBattleAct, -1.0, -1.0, true, 0, 0);
		
	else
	-- 共通関数でロジックを判別
	-- この中で戦闘、非戦闘を判別して設定を行っている。
		COMMON_EasySetup3( ai);
		
	end

end


-----------------------------------------------------------------------------------------------
--	レンドル王子用の割り込みロジック
--	現在の状態でわりこめるのであればtrueを、
--	そのまま無視するのであればfalseを返してください。
-----------------------------------------------------------------------------------------------
function	ouji_807000_Interupt(ai, goal)
end





