-----------------------------------------------------------------------------------------------
--	ロジックリストの一覧
--	ロジックIDはここで決定してください。
--	管理のしやすいIDをつけて下さい
-----------------------------------------------------------------------------------------------

-- デフォルト（通常戦闘）
LOGIC_ID_Default			= 0;

-- 汎用
LOGIC_ID_Hanyou10000		= 10000;

-- 何もしない用
LOGIC_ID_Nanimosinai11000	= 11000;

-- 奴隷兵士
LOGIC_ID_Dorei200000		= 200000;

-- 虜囚
LOGIC_ID_Ryosyu207000		= 207000;
LOGIC_ID_Ryosyu207005		= 207005;

-- 腐敗ヒト（槌）
LOGIC_ID_Huhai210000		= 210000;
LOGIC_ID_Huhai210005		= 210005;

--ウロコ鉱夫
LOGIC_ID_urokoP211000       = 211000;--ウロコ鉱夫（ピックル）
LOGIC_ID_urokoF211001       = 211001;--ウロコ鉱夫（袋）
--LOGIC_ID_urokoSS211002      = 211002;--ウロコ鉱夫（小剣）
--LOGIC_ID_urokoLS211003      = 211003;--ウロコ鉱夫（大剣）
LOGIC_ID_uroko211004        = 211004;--ウロコ鉱夫（獄吏と一緒）
--LOGIC_ID_uroko211005        = 211005;--ウロコ鉱夫（獄吏と一緒、広い）
LOGIC_ID_uroko211009        = 211009;--ウロコ鉱夫（素手、岩投げ）

--影女
LOGIC_ID_KageOnna213000		= 213000;

--ガーゴイル。
LOGIC_ID_Gagoiru305000		= 305000;	--剣

--結晶トカゲ
LOGIC_ID_tokage311000       = 311000;      
--特殊羽クマムシ
LOGIC_ID_HaneKuma313006		= 313006;

--タコ男
LOGIC_ID_Tako403000			= 403000;

--大蜘蛛
LOGIC_ID_kumo510000         = 510000;

-- 嵐の戦士
LOGIC_ID_ArasiSensi602000	= 602000;

-- ヒロイン
LOGIC_ID_Heroine_715000		= 715000;

--レンドル王子
LOGIC_ID_Ouji_807000		= 807000;

--ビヨルングルム
LOGIC_ID_Biyo808001			= 808001;	--王城４ドラゴン退治

--パッチ（坑道）
LOGIC_ID_Patch809000		= 809000;

--ゴルドラン。
LOGIC_ID_GalV816000			= 816000;
