-----------------------------------------------------------------------------------------------
--	テンプレート
--	説明：
--
--	パラメータ0  なし
--	パラメータ1  なし
--	パラメータ2  なし
--	パラメータ3　なし
-----------------------------------------------------------------------------------------------
REGISTER_GOAL(GOAL_COMMON_Template2, "Template");



---------------------------------------------------------
--  ゴール起動
---------------------------------------------------------
function Template_Activate(ai, goal)
end


---------------------------------------------------------
--  ゴール更新
---------------------------------------------------------
function Template_Update(ai, goal)
	return GOAL_RESULT_Continue;
end


---------------------------------------------------------
--  ゴール終了
---------------------------------------------------------
function Template_Terminate(ai, goal)
end


---------------------------------------------------------
--  割り込み
--	割り込んだ場合にはtrueを返してください。
--	ここで割り込み用のサブゴールを追加してください。
--	割り込まなかった場合には、1つ上の層のゴール、またはロジック部分によって割り込みが処理されます。
---------------------------------------------------------
function Template_Interupt(ai, goal)
	return false;
end
