
--------------------------------------------------------------------------------------
--イベント初期化■ボス固有のイベントを登録する際に使用してください
--------------------------------------------------------------------------------------
function EventBoss_Initialize_m02_02_00_00(proxy)
	print(" EventBoss_Initialize_m02_02_00_00 begin");
	--クライアントで無いなら　シングル　or　ホスト
	if	proxy:IsClient() == false then
		proxy:RequestForceUpdateNetwork( 802 );
	end
	print(" EventBoss_Initialize_m02_02_00_00 end");
end

--------------------------------------------------------------------------------------
--ボス用の初期化処理が必要なときに使用：固有情報の作成等
--------------------------------------------------------------------------------------
function BossInit(proxy,param)	
end
