
--------------------------------------------------------------------------------------
--マップ読み込み時に読まれる初期化処理■
--------------------------------------------------------------------------------------
function Initialize_m03_00_00_00(proxy)
	print("Initialize_m03_00_00_00 begin");

--■999999■フレーム遅れの初期化処理イベントを発行■
	proxy:NotNetMessage_begin();
		--▼0秒後▼--
		proxy:OnKeyTime2( 999990, "Second_Initialize_m03_00_00_00", 0.0, 0, 0, once );	
	proxy:NotNetMessage_end();	

	print("Initialize_m03_00_00_00 end");
end

--------------------------------------------------------------------------------------
--Initializeから呼ばれる、1フレーム遅れの初期化処理■999999
--------------------------------------------------------------------------------------
function Second_Initialize_m03_00_00_00(proxy, param)
	print("Second_Initialize_m03_00_00_00 begin");
	print("Second_Initialize_m03_00_00_00 end");
end


--------------------------------------------------------------------------------------
--マルチになった時にホストじゃ無かったら■無し
--------------------------------------------------------------------------------------
function ConnectPartyEvent(proxy)
	print("ConnectPartyEvent begin");
	print("ConnectPartyEvent end");
end
