
--------------------------------------------------------------------------------------
--イベント初期化■ボス固有のイベントを登録する際に使用してください
--------------------------------------------------------------------------------------
function EventBoss_Initialize_m99_99_98_04(proxy)
	print("EventBoss_Initialize ダミー begin");
	print("EventBoss_Initialize ダミー end");
end

--------------------------------------------------------------------------------------
--ボス用の初期化処理が必要なときに使用：固有情報の作成等
--------------------------------------------------------------------------------------
function BossInit_KingOfShield(proxy,param)
	--一時的にコメントアウト
	--proxy:CreateKingOfShield(801,100);
end
